#ifndef _FANDRV_H_
#define _FANDRV_H_

#include "type.h"
#include "stm32f4xx_hal.h"

// Назначение ног 
#define FAN_MK_Pin              GPIO_PIN_3                   // PC3
#define FAN_MK_GPIO_Port        GPIOC

/*-----------------------------------------------------------------------------
Define the structure of the FAN Driver Object 
-----------------------------------------------------------------------------*/
typedef struct {   
   float IgbtFanTask;         // Состояние вентилятора - Вкл/Выкл
   float BoardFanTask;        // Состояние вентилятора - Вкл/Выкл
   void (*init)();            // Настройка драйвера управления вентиляторов
   void (*update)();          // Обновить задание для вентиляторов
} FAN;    

/*-----------------------------------------------------------------------------
Define a FAN_handle
-----------------------------------------------------------------------------*/
typedef FAN *FAN_handle;

/*------------------------------------------------------------------------------
Default Initializers for FAN Object 
------------------------------------------------------------------------------*/
#define FAN_DEFAULTS { 0.0f,                      \
                       0.0f,                      \
                       (void (*)(u32))InitFan,    \
                       (void (*)(u32))UpdateFan,  \
                     }

/*------------------------------------------------------------------------------
 Prototypes for the functions
------------------------------------------------------------------------------*/
void InitFan(FAN_handle);     // Настроить вентиляторы
void UpdateFan(FAN_handle);   // Обновить задание для вентеляторов

#endif // _FANDRV_H_