#ifndef _FANDRV_H_
#define _FANDRV_H_

#include "type.h"
#include "stm32f4xx_hal.h"

// Назначение ног 
#define FAN_1_PIN         GPIO_PIN_0     // PB 0
#define FAN_1_PORT        GPIOB          // PB 0

#define FAN_2_PIN         GPIO_PIN_6     // PA 6
#define FAN_2_PORT        GPIOA          // PA 6

#define RCC_APB1          90000.0f       // Частота тактирования шины в кГц
#define FREQ_TIM1         90000.0f       // Частота тактирования таймера в кГц             

#define MAX_TASK_FAN      100.0f         // Максимальное задание для вентелятора (в %)

/*-----------------------------------------------------------------------------
Define the structure of the FAN Driver Object 
-----------------------------------------------------------------------------*/
typedef struct {   
   float IgbtFanTask;         // Состояние вентилятора - Вкл/Выкл
   float BoardFanTask;        // Состояние вентилятора - Вкл/Выкл
   float Fpwm;                // Частота ШИМ для управления вентеляторами
   void (*init)();            // Настройка драйвера управления вентиляторов
   void (*update)();          // Обновить задание для вентиляторов
} FAN;    

/*-----------------------------------------------------------------------------
Define a FAN_handle
-----------------------------------------------------------------------------*/
typedef FAN *FAN_handle;

/*------------------------------------------------------------------------------
Default Initializers for FAN Object 
------------------------------------------------------------------------------*/
#define FAN_DEFAULTS { 0.0f,                      \
                       0.0f,                      \
                       2.5,                       \
                       (void (*)(u32))InitFan,    \
                       (void (*)(u32))UpdateFan,  \
                     }

/*------------------------------------------------------------------------------
 Prototypes for the functions
------------------------------------------------------------------------------*/
void InitFan(FAN_handle);     // Настроить вентиляторы
void UpdateFan(FAN_handle);   // Обновить задание для вентеляторов

#endif // _FANDRV_H_