;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.1.0 *
;* Date/Time created: Wed Sep 22 00:49:54 2010                 *
;***************************************************************
	.compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("LoadVar.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.1.0 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Andre\programms\programms10\000_AT24\LibMicroProg")
	.global	_nBitNeg
	.sect	".econst:_nBitNeg"
	.clink
	.align	1
_nBitNeg:
	.field  	65534,16			; _nBitNeg[0] @ 0
	.field  	65533,16			; _nBitNeg[1] @ 16
	.field  	65531,16			; _nBitNeg[2] @ 32
	.field  	65527,16			; _nBitNeg[3] @ 48
	.field  	65519,16			; _nBitNeg[4] @ 64
	.field  	65503,16			; _nBitNeg[5] @ 80
	.field  	65471,16			; _nBitNeg[6] @ 96
	.field  	65407,16			; _nBitNeg[7] @ 112
	.field  	65279,16			; _nBitNeg[8] @ 128
	.field  	65023,16			; _nBitNeg[9] @ 144
	.field  	64511,16			; _nBitNeg[10] @ 160
	.field  	63487,16			; _nBitNeg[11] @ 176
	.field  	61439,16			; _nBitNeg[12] @ 192
	.field  	57343,16			; _nBitNeg[13] @ 208
	.field  	49151,16			; _nBitNeg[14] @ 224
	.field  	32767,16			; _nBitNeg[15] @ 240


	.dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
$C$DW$T$817	.dwtag  DW_TAG_typedef, DW_AT_name("_iq5")
	.dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
$C$DW$T$818	.dwtag  DW_TAG_typedef, DW_AT_name("_iq4")
	.dwattr $C$DW$T$818, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$818, DW_AT_language(DW_LANG_C)
$C$DW$T$819	.dwtag  DW_TAG_typedef, DW_AT_name("_iq3")
	.dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
$C$DW$T$820	.dwtag  DW_TAG_typedef, DW_AT_name("_iq2")
	.dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
$C$DW$T$821	.dwtag  DW_TAG_typedef, DW_AT_name("_iq1")
	.dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$821, DW_AT_language(DW_LANG_C)
$C$DW$T$822	.dwtag  DW_TAG_typedef, DW_AT_name("int32")
	.dwattr $C$DW$T$822, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$822, DW_AT_language(DW_LANG_C)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("u32")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
$C$DW$T$98	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
$C$DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("MEM_sizep")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
$C$DW$T$196	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)

$C$DW$T$591	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$196)
	.dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$591, DW_AT_byte_size(0x0a)
$C$DW$172	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$172, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$591


$C$DW$T$592	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$592, DW_AT_type(*$C$DW$T$196)
	.dwattr $C$DW$T$592, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$592, DW_AT_byte_size(0x04)
$C$DW$173	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$173, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$592

$C$DW$T$823	.dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
	.dwattr $C$DW$T$823, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$823, DW_AT_language(DW_LANG_C)
$C$DW$T$824	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$824, DW_AT_language(DW_LANG_C)
$C$DW$174	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$13)
$C$DW$T$825	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$825, DW_AT_type(*$C$DW$174)
$C$DW$T$826	.dwtag  DW_TAG_typedef, DW_AT_name("vu32")
	.dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$825)
	.dwattr $C$DW$T$826, DW_AT_language(DW_LANG_C)
$C$DW$T$827	.dwtag  DW_TAG_typedef, DW_AT_name("LgUns")
	.dwattr $C$DW$T$827, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$827, DW_AT_language(DW_LANG_C)
$C$DW$T$828	.dwtag  DW_TAG_typedef, DW_AT_name("LgBits")
	.dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("s64")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
$C$DW$T$829	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$829, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$829, DW_AT_language(DW_LANG_C)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$830	.dwtag  DW_TAG_typedef, DW_AT_name("u64")
	.dwattr $C$DW$T$830, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$830, DW_AT_language(DW_LANG_C)
$C$DW$T$831	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$831, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$831, DW_AT_language(DW_LANG_C)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("f32")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
$C$DW$T$835	.dwtag  DW_TAG_typedef, DW_AT_name("Float")
	.dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
$C$DW$T$836	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$836, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$836, DW_AT_language(DW_LANG_C)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$837	.dwtag  DW_TAG_typedef, DW_AT_name("f64")
	.dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
$C$DW$T$838	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$838, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$838, DW_AT_language(DW_LANG_C)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("moStruct")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

$C$DW$T$776	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$776, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$776, DW_AT_address_class(0x16)

$C$DW$T$23	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$175, DW_AT_name("i")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_i")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$176, DW_AT_name("s")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_s")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$23

$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("filtr_type")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$177, DW_AT_name("Offset")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_Offset")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$178, DW_AT_name("Gain")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("ustir_type")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$179, DW_AT_name("ZerMin")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_ZerMin")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$180, DW_AT_name("ZerMax")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_ZerMax")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$181, DW_AT_name("Zer_aper")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_Zer_aper")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$182, DW_AT_name("sqrSum")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_sqrSum")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$27

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("Var_type")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$183, DW_AT_name("SumCos")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_SumCos")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$184, DW_AT_name("SumSin")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_SumSin")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$185, DW_AT_name("SumCosCopy")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_SumCosCopy")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$186, DW_AT_name("SumSinCopy")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_SumSinCopy")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$187, DW_AT_name("Iact")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_Iact")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$188, DW_AT_name("Ireact")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_Ireact")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$189, DW_AT_name("Ifull")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_Ifull")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$28

$C$DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("CapCur_type")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$190, DW_AT_name("periodOut")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_periodOut")
	.dwattr $C$DW$190, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$191, DW_AT_name("CopyOk")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_CopyOk")
	.dwattr $C$DW$191, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$192, DW_AT_name("flagCalcOffset")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_flagCalcOffset")
	.dwattr $C$DW$192, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30


$C$DW$T$33	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$193, DW_AT_name("lli")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_lli")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$194, DW_AT_name("i")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_i")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33

$C$DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("LL_filtr_type")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$195, DW_AT_name("Sum")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_Sum")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$196, DW_AT_name("tek")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_tek")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$197, DW_AT_name("cnt")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_cnt")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$34

$C$DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("filtrSum_type")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("MASK_FAST_FAIL_DRV")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$198, DW_AT_name("None")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_None")
	.dwattr $C$DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$199, DW_AT_name("SwU")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_SwU")
	.dwattr $C$DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$200, DW_AT_name("SwV")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_SwV")
	.dwattr $C$DW$200, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$201, DW_AT_name("SwW")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_SwW")
	.dwattr $C$DW$201, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$202, DW_AT_name("SwT")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_SwT")
	.dwattr $C$DW$202, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$203, DW_AT_name("MtzD")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_MtzD")
	.dwattr $C$DW$203, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$204, DW_AT_name("MtzA")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_MtzA")
	.dwattr $C$DW$204, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$205, DW_AT_name("r7")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_r7")
	.dwattr $C$DW$205, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$206, DW_AT_name("UdMin")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_UdMin")
	.dwattr $C$DW$206, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$207, DW_AT_name("UdMax")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_UdMax")
	.dwattr $C$DW$207, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$208, DW_AT_name("UdCharge")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_UdCharge")
	.dwattr $C$DW$208, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$209, DW_AT_name("Ud_KZ")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_Ud_KZ")
	.dwattr $C$DW$209, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$210, DW_AT_name("Tu")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_Tu")
	.dwattr $C$DW$210, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$211, DW_AT_name("r13")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_r13")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$212, DW_AT_name("r14")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_r14")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$213, DW_AT_name("r15")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_r15")
	.dwattr $C$DW$213, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$35


$C$DW$T$36	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$214, DW_AT_name("$P$T1")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_$P$T1")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$215, DW_AT_name("all")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$36

$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("FastFailMask_type")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("FLAG_CMD_DRV")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$216, DW_AT_name("PwmOn")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_PwmOn")
	.dwattr $C$DW$216, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$217, DW_AT_name("ChargeOk")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_ChargeOk")
	.dwattr $C$DW$217, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$218, DW_AT_name("ExternFail")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_ExternFail")
	.dwattr $C$DW$218, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$219, DW_AT_name("Sync_Pwr")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_Sync_Pwr")
	.dwattr $C$DW$219, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$220, DW_AT_name("TormSwAnable")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_TormSwAnable")
	.dwattr $C$DW$220, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$221, DW_AT_name("TormConstCurrOn")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_TormConstCurrOn")
	.dwattr $C$DW$221, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$37


$C$DW$T$38	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$222, DW_AT_name("$P$T2")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_$P$T2")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$223, DW_AT_name("all")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("FlagComand_type")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("FLAG_STATE_DRV")
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$224, DW_AT_name("OFF_PWM")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_OFF_PWM")
	.dwattr $C$DW$224, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$225, DW_AT_name("OFF_ZAR")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_OFF_ZAR")
	.dwattr $C$DW$225, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$226, DW_AT_name("LockOk_Pwr")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_LockOk_Pwr")
	.dwattr $C$DW$226, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$227, DW_AT_name("flag_FastFailMaskMP")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_flag_FastFailMaskMP")
	.dwattr $C$DW$227, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$39


$C$DW$T$40	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$228, DW_AT_name("$P$T3")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_$P$T3")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$229, DW_AT_name("all")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("FlagState_type")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$230, DW_AT_name("n_1")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_n_1")
	.dwattr $C$DW$230, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$231, DW_AT_name("n_2")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_n_2")
	.dwattr $C$DW$231, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$232, DW_AT_name("n_3")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_n_3")
	.dwattr $C$DW$232, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$233, DW_AT_name("n_4")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_n_4")
	.dwattr $C$DW$233, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$234, DW_AT_name("n_5")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_n_5")
	.dwattr $C$DW$234, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$235, DW_AT_name("n_6")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_n_6")
	.dwattr $C$DW$235, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$236, DW_AT_name("n_7")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_n_7")
	.dwattr $C$DW$236, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$237, DW_AT_name("n_8")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_n_8")
	.dwattr $C$DW$237, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41


$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$238, DW_AT_name("all")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$239, DW_AT_name("bit")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$42

$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("Din_type")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0xc6)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$240, DW_AT_name("Iv_adcVal")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_Iv_adcVal")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$241, DW_AT_name("Iw_adcVal")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_Iw_adcVal")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$242, DW_AT_name("iu")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_iu")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$243, DW_AT_name("iv")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_iv")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$244, DW_AT_name("iw")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_iw")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$245, DW_AT_name("Tu_adcVal")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_Tu_adcVal")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$246, DW_AT_name("Imax_adcVal")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_Imax_adcVal")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$247, DW_AT_name("Ain1_adcVal")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_Ain1_adcVal")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$248, DW_AT_name("Ain2_adcVal")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_Ain2_adcVal")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$249, DW_AT_name("Ain3_adcVal")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_Ain3_adcVal")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$250, DW_AT_name("Ain4_adcVal")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_Ain4_adcVal")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$251, DW_AT_name("Ain5_adcVal")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_Ain5_adcVal")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$252, DW_AT_name("Ain6_adcVal")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_Ain6_adcVal")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$253, DW_AT_name("UdFiltr")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_UdFiltr")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$254, DW_AT_name("IvFiltr")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_IvFiltr")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$255, DW_AT_name("IwFiltr")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_IwFiltr")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$256, DW_AT_name("IuUstir")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_IuUstir")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$257, DW_AT_name("IvUstir")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_IvUstir")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$258, DW_AT_name("IwUstir")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_IwUstir")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$259, DW_AT_name("UdUstir")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_UdUstir")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$260, DW_AT_name("IvCalc")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_IvCalc")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$261, DW_AT_name("IwCalc")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_IwCalc")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$262, DW_AT_name("IuCC")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_IuCC")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$263, DW_AT_name("IvCC")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_IvCC")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$264, DW_AT_name("IwCC")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_IwCC")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$265, DW_AT_name("cntCosAdd")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_cntCosAdd")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$266, DW_AT_name("cntCosAddCopy")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_cntCosAddCopy")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$267, DW_AT_name("$P$T0")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_$P$T0")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$268, DW_AT_name("cntCalcOffset")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_cntCalcOffset")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$269, DW_AT_name("Ireact_out")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_Ireact_out")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$270, DW_AT_name("Ifull_out")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_Ifull_out")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$271, DW_AT_name("Iact_out")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_Iact_out")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$272, DW_AT_name("filtr_Ireact_out")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_filtr_Ireact_out")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$273, DW_AT_name("filtr_Ifull_out")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_filtr_Ifull_out")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$274, DW_AT_name("filtr_Iact_out")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_filtr_Iact_out")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$275, DW_AT_name("Iu")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_Iu")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$276, DW_AT_name("Iv")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_Iv")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$277, DW_AT_name("Iw")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_Iw")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$278, DW_AT_name("UdFast")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_UdFast")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$279, DW_AT_name("Ud")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_Ud")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$280, DW_AT_name("StepAngleMax")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_StepAngleMax")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$281, DW_AT_name("Angle")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_Angle")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$282, DW_AT_name("cosT")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_cosT")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$283, DW_AT_name("sinT")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_sinT")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$284, DW_AT_name("Uout")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_Uout")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$285, DW_AT_name("UoutReal")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_UoutReal")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$286, DW_AT_name("Fout")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_Fout")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$287, DW_AT_name("Pact_out")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_Pact_out")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$288, DW_AT_name("Pfull_out")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_Pfull_out")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$289, DW_AT_name("cosFi_out")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_cosFi_out")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$290, DW_AT_name("Ud0")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_Ud0")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$291, DW_AT_name("Ud100")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_Ud100")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$292, DW_AT_name("MTZref")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_MTZref")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$293, DW_AT_name("KustirCurOut")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_KustirCurOut")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$294, DW_AT_name("KustirUd")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_KustirUd")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$295, DW_AT_name("maxValCur_out")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_maxValCur_out")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x99]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$296, DW_AT_name("maxValUd")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_maxValUd")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$297, DW_AT_name("CherFaz")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_CherFaz")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x9b]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$298, DW_AT_name("Udmin")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_Udmin")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$299, DW_AT_name("Udmax")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_Udmax")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$300, DW_AT_name("TuV")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_TuV")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$301, DW_AT_name("Imax_Val")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_Imax_Val")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$302, DW_AT_name("Ain1_Val")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_Ain1_Val")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$303, DW_AT_name("Ain2_Val")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_Ain2_Val")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$304, DW_AT_name("ImaxOffset")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_ImaxOffset")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$305, DW_AT_name("Tmax")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_Tmax")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$306, DW_AT_name("NumFail")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_NumFail")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$307, DW_AT_name("NumSlowFail")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_NumSlowFail")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xb3]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$308, DW_AT_name("FastFailMask")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_FastFailMask")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$309, DW_AT_name("FastFailMaskMP")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_FastFailMaskMP")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xb5]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$310, DW_AT_name("FlagComand")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_FlagComand")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$311, DW_AT_name("FlagState")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_FlagState")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xb7]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$312, DW_AT_name("FailLockFlag")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_FailLockFlag")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$313, DW_AT_name("cntOffZarClear")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_cntOffZarClear")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xb9]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$314, DW_AT_name("Ifull_out_fval")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_Ifull_out_fval")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$315, DW_AT_name("Iact_out_fval")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_Iact_out_fval")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xbb]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$316, DW_AT_name("Iw_fval")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_Iw_fval")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$317, DW_AT_name("Iv_fval")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_Iv_fval")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$318, DW_AT_name("Iu_fval")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_Iu_fval")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$319, DW_AT_name("Ud_fval")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_Ud_fval")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xbf]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$320, DW_AT_name("Fout_fval")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_Fout_fval")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$321, DW_AT_name("NumFail_fval")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_NumFail_fval")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$322, DW_AT_name("Iu_adcVal_fail")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_Iu_adcVal_fail")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$323, DW_AT_name("Iv_adcVal_fail")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_Iv_adcVal_fail")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc3]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$324, DW_AT_name("Iw_adcVal_fail")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_Iw_adcVal_fail")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$325, DW_AT_name("Din")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_Din")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$53

$C$DW$T$839	.dwtag  DW_TAG_typedef, DW_AT_name("measMem_type")
	.dwattr $C$DW$T$839, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$839, DW_AT_language(DW_LANG_C)

$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x2e)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$326, DW_AT_name("CrcMicroprog")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_CrcMicroprog")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$327, DW_AT_name("SignatCoreMicro")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_SignatCoreMicro")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$328, DW_AT_name("szFlash")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_szFlash")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$329, DW_AT_name("kolvRam_All")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_kolvRam_All")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$330, DW_AT_name("kolvNvRam_All")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_kolvNvRam_All")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$331, DW_AT_name("Pnt_float_Sect")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_Pnt_float_Sect")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$332, DW_AT_name("Pnt_s32_Sect")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_Pnt_s32_Sect")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$333, DW_AT_name("Pnt_s16_Sect")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_Pnt_s16_Sect")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$334, DW_AT_name("Sz_bit_Sect")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_Sz_bit_Sect")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$335, DW_AT_name("PntRam_Mb_0x05")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_PntRam_Mb_0x05")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$336, DW_AT_name("kolv_Mb_0x05")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_kolv_Mb_0x05")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$337, DW_AT_name("PntConst_float")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_PntConst_float")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$338, DW_AT_name("kolvConst_float")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_kolvConst_float")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$339, DW_AT_name("PntConst_s32")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_PntConst_s32")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$340, DW_AT_name("kolvConst_s32")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_kolvConst_s32")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$341, DW_AT_name("PntConst_s16")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_PntConst_s16")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$342, DW_AT_name("kolvConst_s16")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_kolvConst_s16")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$343, DW_AT_name("Reserv")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_Reserv")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$344, DW_AT_name("PntOpisGrp")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_PntOpisGrp")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$345, DW_AT_name("kolvGrp")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_kolvGrp")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$346, DW_AT_name("PntOpisUst")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_PntOpisUst")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$347, DW_AT_name("kolvUst")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_kolvUst")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$348, DW_AT_name("PntOpisTek")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_PntOpisTek")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$349, DW_AT_name("kolvTek")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_kolvTek")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$350, DW_AT_name("PntMicroProg")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_PntMicroProg")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$351, DW_AT_name("kolvFuncMicroProg")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_kolvFuncMicroProg")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$352, DW_AT_name("PntPwrValUst")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_PntPwrValUst")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$353, DW_AT_name("CRC16_NV")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_CRC16_NV")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$354, DW_AT_name("PntModbus_0x2B")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_PntModbus_0x2B")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$355, DW_AT_name("kolvModbus_0x2B")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_kolvModbus_0x2B")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$56

$C$DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("MicroProg_type")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
$C$DW$356	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$60)
$C$DW$T$61	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$356)
$C$DW$T$62	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_address_class(0x16)

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x06)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$357, DW_AT_name("PntNumOpisPrm")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_PntNumOpisPrm")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$358, DW_AT_name("kolvPrmInGrp")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_kolvPrmInGrp")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$359, DW_AT_name("LedName")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_LedName")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$58

$C$DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("OpisGrp_type")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
$C$DW$360	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$63)
$C$DW$T$64	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$360)
$C$DW$T$65	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$65, DW_AT_address_class(0x16)

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x0a)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$361, DW_AT_name("AdrVal")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_AdrVal")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$362, DW_AT_name("LowLim")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_LowLim")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$363, DW_AT_name("HighLim")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_HighLim")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$364, DW_AT_name("StepEdIsm")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_StepEdIsm")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$365, DW_AT_name("Flags")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_Flags")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$366, DW_AT_name("LedName")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_LedName")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$59

$C$DW$T$66	.dwtag  DW_TAG_typedef, DW_AT_name("OpisPrm_type")
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
$C$DW$367	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$66)
$C$DW$T$67	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$367)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x16)

$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x2a)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$368, DW_AT_name("PntMicroProg")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_PntMicroProg")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$369, DW_AT_name("PntOpisGrp")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_PntOpisGrp")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$370, DW_AT_name("PntOpisUst")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_PntOpisUst")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$371, DW_AT_name("PntOpisTek")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_PntOpisTek")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$372, DW_AT_name("PntBase")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_PntBase")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$373, DW_AT_name("ramPnt")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_ramPnt")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$374, DW_AT_name("CodeMicroProg")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_CodeMicroProg")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$375, DW_AT_name("kolvGrpOpis")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_kolvGrpOpis")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$376, DW_AT_name("kolvPrmOpis")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_kolvPrmOpis")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$377, DW_AT_name("Base")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_Base")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$378, DW_AT_name("kolvState")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_kolvState")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$379, DW_AT_name("cntCall")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_cntCall")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$380, DW_AT_name("cntCallStop")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_cntCallStop")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$381, DW_AT_name("NumFuncStop")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_NumFuncStop")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$382, DW_AT_name("NumFunc")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_NumFunc")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$383, DW_AT_name("kolvFunc")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_kolvFunc")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$73

$C$DW$T$840	.dwtag  DW_TAG_typedef, DW_AT_name("MPOpis_type")
	.dwattr $C$DW$T$840, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$840, DW_AT_language(DW_LANG_C)

$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x3f0)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$384, DW_AT_name("Net_Fict1_bit")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_Net_Fict1_bit")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$385, DW_AT_name("STOP_NETWORK")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_STOP_NETWORK")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$386, DW_AT_name("STOP_SLEEP")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_STOP_SLEEP")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$387, DW_AT_name("STOP_SLEEP_NOT")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_STOP_SLEEP_NOT")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$388, DW_AT_name("TORM_DC")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_TORM_DC")
	.dwattr $C$DW$388, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$389, DW_AT_name("UST_F_ZADANYE_SIGN")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_UST_F_ZADANYE_SIGN")
	.dwattr $C$DW$389, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$390, DW_AT_name("UST_NAPR_VR_B")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_UST_NAPR_VR_B")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$391, DW_AT_name("UST_PRIO_FOR_REV")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_UST_PRIO_FOR_REV")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$392, DW_AT_name("U_IN_ER")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_U_IN_ER")
	.dwattr $C$DW$392, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$393, DW_AT_name("VYBEG_TIME")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_VYBEG_TIME")
	.dwattr $C$DW$393, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$394, DW_AT_name("VYBEG_TIME_NOT")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_VYBEG_TIME_NOT")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$395, DW_AT_name("WORK_FLAG")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_WORK_FLAG")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$396, DW_AT_name("WORK_FLAG_NOT")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_WORK_FLAG_NOT")
	.dwattr $C$DW$396, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$397, DW_AT_name("Net_Fict_bit")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_Net_Fict_bit")
	.dwattr $C$DW$397, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$398, DW_AT_name("PWM_ON")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_PWM_ON")
	.dwattr $C$DW$398, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$399, DW_AT_name("PWM_ON_DRV")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_PWM_ON_DRV")
	.dwattr $C$DW$399, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$400, DW_AT_name("PWM_ON_IMP")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_PWM_ON_IMP")
	.dwattr $C$DW$400, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$401, DW_AT_name("RESET_APV")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_RESET_APV")
	.dwattr $C$DW$401, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$402, DW_AT_name("RESET_APV_NET")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_RESET_APV_NET")
	.dwattr $C$DW$402, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$403, DW_AT_name("RESET_CNT_JOB_NET")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_RESET_CNT_JOB_NET")
	.dwattr $C$DW$403, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$404, DW_AT_name("RESTT_CNT_JOB_DIN")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_RESTT_CNT_JOB_DIN")
	.dwattr $C$DW$404, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$405, DW_AT_name("SIGN_F_REF_DRV")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_SIGN_F_REF_DRV")
	.dwattr $C$DW$405, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$406, DW_AT_name("SLEEP_DR_ON")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_SLEEP_DR_ON")
	.dwattr $C$DW$406, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$407, DW_AT_name("START")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_START")
	.dwattr $C$DW$407, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$408, DW_AT_name("START_OK")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_START_OK")
	.dwattr $C$DW$408, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$409, DW_AT_name("STOP_ALL")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_STOP_ALL")
	.dwattr $C$DW$409, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$410, DW_AT_name("STOP_DIN")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_STOP_DIN")
	.dwattr $C$DW$410, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$411, DW_AT_name("STOP_FREQ")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_STOP_FREQ")
	.dwattr $C$DW$411, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$412, DW_AT_name("STOP_FREQ_PULSE")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_STOP_FREQ_PULSE")
	.dwattr $C$DW$412, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$413, DW_AT_name("STOP_KEY")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_STOP_KEY")
	.dwattr $C$DW$413, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$414, DW_AT_name("OFF_PWM_FAIL")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_OFF_PWM_FAIL")
	.dwattr $C$DW$414, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$415, DW_AT_name("OFF_ZAR")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_OFF_ZAR")
	.dwattr $C$DW$415, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$416, DW_AT_name("ON_SINCRO_VOZBUD")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_ON_SINCRO_VOZBUD")
	.dwattr $C$DW$416, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$417, DW_AT_name("PODHVAT")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_PODHVAT")
	.dwattr $C$DW$417, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$418, DW_AT_name("POWER_ER")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_POWER_ER")
	.dwattr $C$DW$418, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$419, DW_AT_name("PUSK_ALL")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_PUSK_ALL")
	.dwattr $C$DW$419, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$420, DW_AT_name("PUSK_ALL_IMP")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_PUSK_ALL_IMP")
	.dwattr $C$DW$420, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$421, DW_AT_name("PUSK_APV")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_PUSK_APV")
	.dwattr $C$DW$421, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$422, DW_AT_name("PUSK_APV_QUERY")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_PUSK_APV_QUERY")
	.dwattr $C$DW$422, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$423, DW_AT_name("PUSK_DIN")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_PUSK_DIN")
	.dwattr $C$DW$423, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$424, DW_AT_name("PUSK_DIN_16_SPEED")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_PUSK_DIN_16_SPEED")
	.dwattr $C$DW$424, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$425, DW_AT_name("PUSK_DIN_QUERY")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_PUSK_DIN_QUERY")
	.dwattr $C$DW$425, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$426, DW_AT_name("PUSK_DIN_QUERY_IMP")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_PUSK_DIN_QUERY_IMP")
	.dwattr $C$DW$426, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$427, DW_AT_name("PUSK_NETWORK")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_PUSK_NETWORK")
	.dwattr $C$DW$427, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$428, DW_AT_name("PUSK_SLEEP_QUERY")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_PUSK_SLEEP_QUERY")
	.dwattr $C$DW$428, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$429, DW_AT_name("PUSK_WAIT_UF")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_PUSK_WAIT_UF")
	.dwattr $C$DW$429, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$430, DW_AT_name("NET00346")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_NET00346")
	.dwattr $C$DW$430, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$431, DW_AT_name("NET00347")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_NET00347")
	.dwattr $C$DW$431, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$432, DW_AT_name("NET00348")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_NET00348")
	.dwattr $C$DW$432, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$433, DW_AT_name("NET00353")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_NET00353")
	.dwattr $C$DW$433, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$434, DW_AT_name("NET00358")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_NET00358")
	.dwattr $C$DW$434, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$435, DW_AT_name("NET00359")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_NET00359")
	.dwattr $C$DW$435, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$436, DW_AT_name("NET00365")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_NET00365")
	.dwattr $C$DW$436, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$437, DW_AT_name("NET00384")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_NET00384")
	.dwattr $C$DW$437, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$438, DW_AT_name("NET00385")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_NET00385")
	.dwattr $C$DW$438, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$439, DW_AT_name("NET00387")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_NET00387")
	.dwattr $C$DW$439, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$440, DW_AT_name("NET00395")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_NET00395")
	.dwattr $C$DW$440, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$441, DW_AT_name("NET00414")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_NET00414")
	.dwattr $C$DW$441, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$442, DW_AT_name("NET00432")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_NET00432")
	.dwattr $C$DW$442, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$443, DW_AT_name("NET00433")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_NET00433")
	.dwattr $C$DW$443, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$444, DW_AT_name("NET00447")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_NET00447")
	.dwattr $C$DW$444, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$445, DW_AT_name("NOT_PWM_ON")
