#ifndef MAKEOPIS_AT24_H
#define MAKEOPIS_AT24_H
#include "MakeOpis.h"

/*===========================================================================*/
/*===========================================================================*/
typedef struct{
    u16     rc          :1;     // 1  - "расчет коэффициентов генератора темпа"
    u16     PWMReinit   :1;     // Запрос на пересчет параметров ШИМ и переинициализацию
    
}rcPrm_type; 

extern rcPrm_type rcPrm;  
/* --------------------------------------------------------------------------- */

typedef u16 (*pntFuncV_WM_type)(wm_type   *wm, s16 Rd);    // тип указателя на функцию
/*===========================================================================*/
Drv_err_type MOspecial(wm_type   *wm, s16 Rd);
void checkSysCalc(void);
/*===========================================================================*/
#endif
