/*=====================================================================================
 File name:     ANTI_ROLLBACK.C                                
 Originator:    Triol Corporation
 Autor:         Sikalov Yuriy
 Description:   Anti rollback function (20ms)               
=====================================================================================
 History:
-------------------------------------------------------------------------------------
 14-03-2012 Version 1.00
-------------------------------------------------------------------------------------*/

#include "anti_rollback.h"

void anti_rollback_calc(ANTIROLLBACK *v)
{
    // активация антиоткатной функции
    if (v->flag.ARollbackEnb){ 
        // по пуску начать выполнение алгоритма антиотката
        if(v->flag.Start) { 
            // отсчет времени до окончания работы антиотката
            if(v->TimeCount >= v->Time) { 
                v->flag.ForceEnb = 0; // по окончанию времени откл усиление регулятора скорости
            } else {
                v->TimeCount += v->TimeStep; // отсчет времени для такта ШИМа
            }
        } else if (!v->flag.PwmOn) {
            v->flag.ForceEnb = 1; // усилить регулятор скорости
            v->TimeCount = 0;     // сброс счетчика
        }
    } else {
        v->flag.ForceEnb = 0;   // не включать усиление регулятора скорости, если антиоткат не включен
        v->TimeCount = 0;       // сброс счетчика
    }
}

