/*=====================================================================================
 File name:        CALC_VAR.C  (float version)                  
                    
 Originator:    Triol

 Description:  Вычисление текущего момента и мощности            

=====================================================================================
 History:
-------------------------------------------------------------------------------------
 03-02-2011 Version 1.00
 05-10-2020 Version 2.00 : float 
-------------------------------------------------------------------------------------*/

#include "calc_var.h"

void calc_var(CALCVAR * v)
{
    //Вычисление момента
    //Me:=Lm/Lr*PhiR*Iq*3*Zp/2
    v->Me = v->K3 * v->Isq * v->IRm;
    // Вычисление фильтрованного значениЯ 
    v->Me_f = v->Me_f + (v->Me - v->Me_f) * v->Tf_Me; 

    //Вычисление мощности, кВт 
    v->P = v->WrElec * v->Me * v->K4 * 0.001f;
}
