/*=====================================================================================
 File name:     DRIVE_WORDS.C                     
                    
 Originator:    Triol

 Description:   Расчет слова статуса          

=====================================================================================
 History:
-------------------------------------------------------------------------------------
 22-12-2010 Version 1.00
 23-09-2020 PAN
-------------------------------------------------------------------------------------*/

#include "DRIVE_CONST.h"
#include "DRIVE_WORDS.h"

void status_calc(DRIVEWORDS * p, DRIVECONST * v)
{
    if(p->Stat.bit.vPrUP == 0){  //Пока поток не нарос выполнять
        if(v->PhiR >= v->PhiR_min ) p->Stat.bit.vPrUP = 1;
    }
}

